Masmiseim36/nxpSDK/devices/MIMXRT117H/mcuxpresso/startup_mimxrt117H_cm7.cpp
WEAK void CM7_GPIO2_3_IRQHandler(void)
{
    CM7_GPIO2_3_DriverIRQHandler();
}

WEAK void GPIO1_Combined_0_15_IRQHandler(void)
{
    GPIO1_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO1_Combined_16_31_IRQHandler(void)
{
    GPIO1_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO2_Combined_0_15_IRQHandler(void)
{
    GPIO2_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO2_Combined_16_31_IRQHandler(void)
{
    GPIO2_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO3_Combined_0_15_IRQHandler(void)
{
    GPIO3_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO3_Combined_16_31_IRQHandler(void)
{
    GPIO3_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO4_Combined_0_15_IRQHandler(void)
{
    GPIO4_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO4_Combined_16_31_IRQHandler(void)
{
    GPIO4_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO5_Combined_0_15_IRQHandler(void)
{
    GPIO5_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO5_Combined_16_31_IRQHandler(void)
{
    GPIO5_Combined_16_31_DriverIRQHandler();
}

WEAK void FLEXIO1_IRQHandler(void)
{
    FLEXIO1_DriverIRQHandler();
}

WEAK void FLEXIO2_IRQHandler(void)
{
    FLEXIO2_DriverIRQHandler();
}

WEAK void WDOG1_IRQHandler(void)
{
    WDOG1_DriverIRQHandler();
}

WEAK void RTWDOG3_IRQHandler(void)
{
    RTWDOG3_DriverIRQHandler();
}

WEAK void EWM_IRQHandler(void)
{
    EWM_DriverIRQHandler();
}

WEAK void OCOTP_READ_FUSE_ERROR_IRQHandler(void)
{
    OCOTP_READ_FUSE_ERROR_DriverIRQHandler();
}

WEAK void OCOTP_READ_DONE_ERROR_IRQHandler(void)
{
    OCOTP_READ_DONE_ERROR_DriverIRQHandler();
}

WEAK void GPC_IRQHandler(void)
{
    GPC_DriverIRQHandler();
}

WEAK void MUA_IRQHandler(void)
{
    MUA_DriverIRQHandler();
}

WEAK void GPT1_IRQHandler(void)
{
    GPT1_DriverIRQHandler();
}

WEAK void GPT2_IRQHandler(void)
{
    GPT2_DriverIRQHandler();
}

WEAK void GPT3_IRQHandler(void)
{
    GPT3_DriverIRQHandler();
}

WEAK void GPT4_IRQHandler(void)
{
    GPT4_DriverIRQHandler();
}

WEAK void GPT5_IRQHandler(void)
{
    GPT5_DriverIRQHandler();
}

WEAK void GPT6_IRQHandler(void)
{
    GPT6_DriverIRQHandler();
}

WEAK void PWM1_0_IRQHandler(void)
{
    PWM1_0_DriverIRQHandler();
}

WEAK void PWM1_1_IRQHandler(void)
{
    PWM1_1_DriverIRQHandler();
}

WEAK void PWM1_2_IRQHandler(void)
{
    PWM1_2_DriverIRQHandler();
}

WEAK void PWM1_3_IRQHandler(void)
{
    PWM1_3_DriverIRQHandler();
}

WEAK void PWM1_FAULT_IRQHandler(void)
{
    PWM1_FAULT_DriverIRQHandler();
}

WEAK void FLEXSPI1_IRQHandler(void)
{
    FLEXSPI1_DriverIRQHandler();
}

WEAK void FLEXSPI2_IRQHandler(void)
{
    FLEXSPI2_DriverIRQHandler();
}

WEAK void SEMC_IRQHandler(void)
{
    SEMC_DriverIRQHandler();
}

WEAK void USDHC1_IRQHandler(void)
{
    USDHC1_DriverIRQHandler();
}

WEAK void USDHC2_IRQHandler(void)
{
    USDHC2_DriverIRQHandler();
}

WEAK void USB_OTG2_IRQHandler(void)
{
    USB_OTG2_DriverIRQHandler();
}

WEAK void USB_OTG1_IRQHandler(void)
{
    USB_OTG1_DriverIRQHandler();
}

WEAK void ENET_IRQHandler(void)
{
    ENET_DriverIRQHandler();
}

WEAK void ENET_1588_Timer_IRQHandler(void)
{
    ENET_1588_Timer_DriverIRQHandler();
}

WEAK void ENET_1G_MAC0_Tx_Rx_1_IRQHandler(void)
{
    ENET_1G_MAC0_Tx_Rx_1_DriverIRQHandler();
}

WEAK void ENET_1G_MAC0_Tx_Rx_2_IRQHandler(void)
{
    ENET_1G_MAC0_Tx_Rx_2_DriverIRQHandler();
}

WEAK void ENET_1G_IRQHandler(void)
{
    ENET_1G_DriverIRQHandler();
}

WEAK void ENET_1G_1588_Timer_IRQHandler(void)
{
    ENET_1G_1588_Timer_DriverIRQHandler();
}

WEAK void XBAR1_IRQ_0_1_IRQHandler(void)
{
    XBAR1_IRQ_0_1_DriverIRQHandler();
}

WEAK void XBAR1_IRQ_2_3_IRQHandler(void)
{
    XBAR1_IRQ_2_3_DriverIRQHandler();
}

WEAK void ADC_ETC_IRQ0_IRQHandler(void)
{
    ADC_ETC_IRQ0_DriverIRQHandler();
}

WEAK void ADC_ETC_IRQ1_IRQHandler(void)
{
    ADC_ETC_IRQ1_DriverIRQHandler();
}

WEAK void ADC_ETC_IRQ2_IRQHandler(void)
{
    ADC_ETC_IRQ2_DriverIRQHandler();
}

WEAK void ADC_ETC_IRQ3_IRQHandler(void)
{
    ADC_ETC_IRQ3_DriverIRQHandler();
}

WEAK void ADC_ETC_ERROR_IRQ_IRQHandler(void)
{
    ADC_ETC_ERROR_IRQ_DriverIRQHandler();
}

WEAK void Reserved166_IRQHandler(void)
{
    Reserved166_DriverIRQHandler();
}

WEAK void Reserved167_IRQHandler(void)
{
    Reserved167_DriverIRQHandler();
}

WEAK void Reserved168_IRQHandler(void)
{
    Reserved168_DriverIRQHandler();
}

WEAK void Reserved169_IRQHandler(void)
{
    Reserved169_DriverIRQHandler();
}

WEAK void Reserved170_IRQHandler(void)
{
    Reserved170_DriverIRQHandler();
}

WEAK void PIT1_IRQHandler(void)
{
    PIT1_DriverIRQHandler();
}

WEAK void PIT2_IRQHandler(void)
{
    PIT2_DriverIRQHandler();
}

WEAK void ACMP1_IRQHandler(void)
{
    ACMP1_DriverIRQHandler();
}

WEAK void ACMP2_IRQHandler(void)
{
    ACMP2_DriverIRQHandler();
}

WEAK void ACMP3_IRQHandler(void)
{
    ACMP3_DriverIRQHandler();
}

WEAK void ACMP4_IRQHandler(void)
{
    ACMP4_DriverIRQHandler();
}

WEAK void Reserved177_IRQHandler(void)
{
    Reserved177_DriverIRQHandler();
}

WEAK void Reserved178_IRQHandler(void)
{
    Reserved178_DriverIRQHandler();
}

WEAK void Reserved179_IRQHandler(void)
{
    Reserved179_DriverIRQHandler();
}

WEAK void Reserved180_IRQHandler(void)
{
    Reserved180_DriverIRQHandler();
}

WEAK void ENC1_IRQHandler(void)
{
    ENC1_DriverIRQHandler();
}

WEAK void ENC2_IRQHandler(void)
{
    ENC2_DriverIRQHandler();
}

WEAK void ENC3_IRQHandler(void)
{
    ENC3_DriverIRQHandler();
}

WEAK void ENC4_IRQHandler(void)
{
    ENC4_DriverIRQHandler();
}

WEAK void Reserved185_IRQHandler(void)
{
    Reserved185_DriverIRQHandler();
}

WEAK void Reserved186_IRQHandler(void)
{
    Reserved186_DriverIRQHandler();
}

WEAK void TMR1_IRQHandler(void)
{
    TMR1_DriverIRQHandler();
}

WEAK void TMR2_IRQHandler(void)
{
    TMR2_DriverIRQHandler();
}

WEAK void TMR3_IRQHandler(void)
{
    TMR3_DriverIRQHandler();
}

WEAK void TMR4_IRQHandler(void)
{
    TMR4_DriverIRQHandler();
}

WEAK void SEMA4_CP0_IRQHandler(void)
{
    SEMA4_CP0_DriverIRQHandler();
}

WEAK void SEMA4_CP1_IRQHandler(void)
{
    SEMA4_CP1_DriverIRQHandler();
}

WEAK void PWM2_0_IRQHandler(void)
{
    PWM2_0_DriverIRQHandler();
}

WEAK void PWM2_1_IRQHandler(void)
{
    PWM2_1_DriverIRQHandler();
}

