Masmiseim36/nxpSDK/devices/MIMXRT117H/mcuxpresso/startup_mimxrt117H_cm7.cpp
WEAK void PWM2_2_IRQHandler(void)
{
    PWM2_2_DriverIRQHandler();
}

WEAK void PWM2_3_IRQHandler(void)
{
    PWM2_3_DriverIRQHandler();
}

WEAK void PWM2_FAULT_IRQHandler(void)
{
    PWM2_FAULT_DriverIRQHandler();
}

WEAK void PWM3_0_IRQHandler(void)
{
    PWM3_0_DriverIRQHandler();
}

WEAK void PWM3_1_IRQHandler(void)
{
    PWM3_1_DriverIRQHandler();
}

WEAK void PWM3_2_IRQHandler(void)
{
    PWM3_2_DriverIRQHandler();
}

WEAK void PWM3_3_IRQHandler(void)
{
    PWM3_3_DriverIRQHandler();
}

WEAK void PWM3_FAULT_IRQHandler(void)
{
    PWM3_FAULT_DriverIRQHandler();
}

WEAK void PWM4_0_IRQHandler(void)
{
    PWM4_0_DriverIRQHandler();
}

WEAK void PWM4_1_IRQHandler(void)
{
    PWM4_1_DriverIRQHandler();
}

WEAK void PWM4_2_IRQHandler(void)
{
    PWM4_2_DriverIRQHandler();
}

WEAK void PWM4_3_IRQHandler(void)
{
    PWM4_3_DriverIRQHandler();
}

WEAK void PWM4_FAULT_IRQHandler(void)
{
    PWM4_FAULT_DriverIRQHandler();
}

WEAK void Reserved208_IRQHandler(void)
{
    Reserved208_DriverIRQHandler();
}

WEAK void Reserved209_IRQHandler(void)
{
    Reserved209_DriverIRQHandler();
}

WEAK void Reserved210_IRQHandler(void)
{
    Reserved210_DriverIRQHandler();
}

WEAK void Reserved211_IRQHandler(void)
{
    Reserved211_DriverIRQHandler();
}

WEAK void Reserved212_IRQHandler(void)
{
    Reserved212_DriverIRQHandler();
}

WEAK void Reserved213_IRQHandler(void)
{
    Reserved213_DriverIRQHandler();
}

WEAK void Reserved214_IRQHandler(void)
{
    Reserved214_DriverIRQHandler();
}

WEAK void Reserved215_IRQHandler(void)
{
    Reserved215_DriverIRQHandler();
}

WEAK void HWVAD_EVENT_IRQHandler(void)
{
    HWVAD_EVENT_DriverIRQHandler();
}

WEAK void HWVAD_ERROR_IRQHandler(void)
{
    HWVAD_ERROR_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{
    PDM_EVENT_DriverIRQHandler();
}

WEAK void PDM_ERROR_IRQHandler(void)
{
    PDM_ERROR_DriverIRQHandler();
}

WEAK void EMVSIM1_IRQHandler(void)
{
    EMVSIM1_DriverIRQHandler();
}

WEAK void EMVSIM2_IRQHandler(void)
{
    EMVSIM2_DriverIRQHandler();
}

WEAK void MECC1_INT_IRQHandler(void)
{
    MECC1_INT_DriverIRQHandler();
}

WEAK void MECC1_FATAL_INT_IRQHandler(void)
{
    MECC1_FATAL_INT_DriverIRQHandler();
}

WEAK void MECC2_INT_IRQHandler(void)
{
    MECC2_INT_DriverIRQHandler();
}

WEAK void MECC2_FATAL_INT_IRQHandler(void)
{
    MECC2_FATAL_INT_DriverIRQHandler();
}

WEAK void XECC_FLEXSPI1_INT_IRQHandler(void)
{
    XECC_FLEXSPI1_INT_DriverIRQHandler();
}

WEAK void XECC_FLEXSPI1_FATAL_INT_IRQHandler(void)
{
    XECC_FLEXSPI1_FATAL_INT_DriverIRQHandler();
}

WEAK void XECC_FLEXSPI2_INT_IRQHandler(void)
{
    XECC_FLEXSPI2_INT_DriverIRQHandler();
}

WEAK void XECC_FLEXSPI2_FATAL_INT_IRQHandler(void)
{
    XECC_FLEXSPI2_FATAL_INT_DriverIRQHandler();
}

WEAK void XECC_SEMC_INT_IRQHandler(void)
{
    XECC_SEMC_INT_DriverIRQHandler();
}

WEAK void XECC_SEMC_FATAL_INT_IRQHandler(void)
{
    XECC_SEMC_FATAL_INT_DriverIRQHandler();
}

WEAK void ENET_QOS_IRQHandler(void)
{
    ENET_QOS_DriverIRQHandler();
}

WEAK void ENET_QOS_PMT_IRQHandler(void)
{
    ENET_QOS_PMT_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
